public class ProgramTask38 {
    public static void main(String... args) {
        // 123/2 = 61(1)
        // 61/2 = 30 (1)
        //  30/2 = 15  15/2 = 7
        // 7/2 = 3 (1)
        // 3/2 = 1 (1)
        // 1/2 = 0 (1)
        int num123 = 1111011;// число 123 в двоичной системе счисления
}


        // 123/8 = 15 (3)
        // 15/8 = 1 (7)
        // 1/8 = 0 (1)
        int num123 = 173;// число 123 в восьмеричной


        // 123/16 = 7 (6)
        // 7/16 = 0(7)
        char num123b = 7b;// число 111 в шестнадцатеричной

        // остаток 10 это A
        // остаток 11 это B
        // остаток 12 это C
        // остаток 13 это D
        // остаток 14 это E
        // остаток 15 это F
    }
}